import Foundation

class SampleData {
    static var notes: [NoteData] = {
        [
            NoteData(
                header: "Вопросы для интервью",
                text: "Как давно ты стал программистом? (задать после небольшо...",
                date: 1_649_669_857
            ),
            NoteData(
                header: "Диплом",
                text: """
            Тема дипломной работы сайт для интерьерной студии, плюс подписать все разделы

            Для защиты диплома нужна будет презентация, в которой должны быть следующие разделы:

            1. Описание аудитории проекта, в том числе пользователей в виде персон.
                Вот хорошая статья про персоны https://blog.sibirix.ru/2013/08/02/metod-person.

            2. Описание проблемы или потребности аудитории, а так же почему вы считаете,
                что у аудитории есть эти проблемы и потребности.
            Для каждой персоны нужно сделать схему JTBD контекст-мотивация-цель
            «Когда (описание ситуации) -> Я хочу (мотивация) -> Чтобы (результат)»
            вот здесь подробно про это написано http://tilda.education/articles-jobs-to-be-done

            Пока на этом остановимся, далее будем детально прорабатывать
            """,
                date: 1_649_669_857
            ),
            NoteData(
                header: "Книги для прочтения",
                text: "Убить пересмешника, 1984, Ответ",
                date: 1_649_669_857
            ),
            NoteData(
                header: "Номера счетов",
                text: "5445674722 - электроэнергия",
                date: 1_649_669_857
            ),
            NoteData(
                header: "Куда сходить в Калининграде",
                text: "Сначала не забыть забронировать стол в Аквамарине, потом...",
                date: 1_649_669_857
            ),
            NoteData(
                header: "Фильмы",
                text: "Скотт Пилигрим против всех, большой Лебовски, типа круты...",
                date: 1_649_669_857
            ),
            NoteData(
                header: "Письмо Олесе",
                text: "Здравствуйте! Меня зовут Евгения, я бы хотела показать вам...",
                date: 1_649_669_857
            ),
            NoteData(
                header: "Карты Тинькофф",
                text: "42001522301200 visa",
                date: 1_649_669_857
            )
        ]
    }()
}
